IdeaRS.Connections
InternalForceOnSegmentData Properties
Compatible with IDEA StatiCa 0.0
The InternalForceOnSegmentData type exposes the following members.
Properties
Name | Description
AbsPosition
 Abs position of load impulsm default 0
BeamSegmentId
 Gets or sets the id of the beam
ForceIn
 Gets or sets force position mode Position = 0, Node = 1, Bolts = 2,
Mx
 torsion moment
My
 bending moment
Mz
 bending moment
N
 normal force
Position
 Gets or sets position 0 - begin 1 - end
Qy
 shear force
Qz
 shear force
Top
See Also
Reference
InternalForceOnSegmentData Class
IdeaRS.Connections.Data Namespace